{
    "entries": [
        {
          "name": "Accokeek",
          "description": "",
          "address": "15773 Livingston Rd\nAccokeek, Maryland 20607",
          "area": "South",
          "image": "http://pgcmls.info/images/tile/pgcmls/Accokeek2013.jpg",
          "area_director": "Melanie Townsend Diggs",
          "website": "https://www.pgcmls.info/branch/location/Accokeek",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Baden",
          "description": "The Baden Branch Library opened to the public on July 6, 1970.  Located in the Brandywine area of southeastern Prince George’s County, it was the first library facility located southeast of Clinton. The current library is housed in the Baden Elementary School, occupies 2,650 square feet and is accessible both from the outside and from the school in which it is located. The new facility will move next door to the former Baden Health Center and will almost double the size of the original library at 4,864 square feet.",
          "address": "13603 Baden-Westwood Rd\nBrandywine, Maryland 20613",
          "area": "South",
          "image": "http://pgcmls.info/images/tile/pgcmls/Baden2013.jpg",
          "area_director": "Melanie Townsend Diggs",
          "website": "https://www.pgcmls.info/branch/location/baden",
          "year": 1970,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Beltsville",
          "description": "In 1942, the unincorporated community of Beltsville also got a library, established by the Women’s Community Club and housed in a room in the local elementary school. However, the space was soon taken back by the school system and this first Beltsville library dissolved.",
          "address": "4319 Sellman Rd\nBeltsville, Maryland 20705",
          "area": "North",
          "image": "http://pgcmls.info/images/tile/pgcmls/Beltsville2013.jpg",
          "area_director": "Karin Luoma",
          "website": "https://www.pgcmls.info/branch/location/Beltsville",
          "year": 1942,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Bladensburg",
          "description": "Alluding to the rich maritime heritage of the port town of Bladensburg, architectural references to the dynamic nature of water and its limitless potential are themes carried throughout the new two-story branch library. Two full-height glass curtain wall systems soar above the streetscape while a continuous masonry band grounds the structure, firmly anchoring it to the site. An abundance of glazing establishes a direct connection with the surrounding neighborhood, allowing pedestrians to glimpse the contemporary interiors of the library while at the same time directing views of the building occupants towards the exterior environment. The new branch library hopes to serve as a catalyst for the community, further advancing the comprehensive vision for redevelopment of the area.\n\nThe original branch was dedicated in October 21, 1978 in a 1920’s-era building that had formerly been the Bladensburg Elementary School and then the Board of Education Media Center.\n\nSize: It will be a 22,834 square-foot building – almost three times the size of the original building\n\nAccolades: This will be the first PGCMLS facility that has been certified LEED Silver.",
          "address": "Temporary Location: 6527 Annapolis Road\nHyattsville, Maryland 20784",
          "area": "West",
          "image": "http://pgcmls.info/images/tile/pgcmls/51654117992_245808c9f1_c.jpg",
          "area_director": "Heather Jackson",
          "website": "https://www.pgcmls.info/branch/location/bladensburg",
          "year": 1978,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Bowie",
          "description": "",
          "address": "15210 Annapolis Rd\nBowie, MD 20715",
          "area": "North",
          "image": "http://pgcmls.info/images/tile/pgcmls/bowie-2017.jpg",
          "area_director": "Karin Luoma",
          "website": "https://www.pgcmls.info/branch/location/bowie",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Fairmount Heights",
          "description": "Fairmount Heights Library is home of the D.R.E.A.M. Lab. Fairmount Heights is an early-twentieth-century African-American suburb located just outside the easternmost corner of the District of Columbia in Prince George’s County. The community is roughly bounded by Sheriff Road, Balsamtree Drive, 62nd Place, and Eastern Avenue.\n\nIn the late nineteenth century, the area that would become Fairmount Heights was the site of several small farms owned by the Wilson, Silence, Hoover, Brown, and Wiessner families. These farms were purchased and consolidated by land speculators in the first decades of the twentieth century. Fairmount Heights contains six subdivisions platted between 1900 and 1923 by different developers. The first was platted as Fairmount Heights in 1900 by Robinson White and Allen Clark, two white attorneys and developers from Washington, D.C. The initial platting contained approximately 50 acres that were divided into lots typically measuring 25 by 125 feet. Robinson White and Allen Clark encouraged African-Americans to settle in the area and the subdivision became one of the first planned communities for black families in the Washington, D.C. area. White and Clark sold the affordable lots making home ownership attainable for many black families. The earliest dwellings were of wood-frame construction of modest size; however several substantial houses were also built.",
          "address": "5904 Kolb St\nFairmount Heights, Maryland 20743",
          "area": "Central",
          "image": "http://pgcmls.info/images/tile/pgcmls/Fairmount-Heights.jpg",
          "area_director": "Quemar Rhoden",
          "website": "https://www.pgcmls.info/branch/location/FairmountHeights",
          "year": "",
          "aa_town": true,
          "comments": []
        },
        {
          "name": "Glenarden",
          "description": "",
          "address": "8724 Glenarden Parkway\nGlenarden, Maryland 20706",
          "area": "Central",
          "image": "http://pgcmls.info/images/tile/pgcmls/Glenarden2013.jpg",
          "area_director": "Quemar Rhoden",
          "website": "https://www.pgcmls.info/branch/location/glenarden",
          "year": 1939,
          "aa_town": true,
          "comments": []
        },
        {
          "name": "Greenbelt",
          "description": "Greenbelt is home of the Tugwell Room. The Greenbelt Library was established by the City of Greenbelt in 1939, only eighteen months after the city itself was founded, and was housed in the Greenbelt Center School, now the Greenbelt Community Center.",
          "address": "11 Crescent Rd\nGreenbelt, Maryland 20770",
          "area": "North",
          "image": "http://pgcmls.info/images/tile/pgcmls/Greenbelt2013.jpg",
          "area_director": "Karin Luoma",
          "website": "https://www.pgcmls.info/branch/location/greenbelt",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Hillcrest Heights",
          "description": "",
          "address": "2398 Iverson St\nTemple Hills, Maryland 20748",
          "area": "Central",
          "image": "http://pgcmls.info/images/tile/pgcmls/Hillcrest%20Heights%20Library%20-2.jpg",
          "area_director": "Quemar Rhoden",
          "website": "https://www.pgcmls.info/branch/location/hillcrestheights",
          "year": 1964,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Hyattsville",
          "description": "Opened in 1964, the Hyattsville Branch was one of the first branch buildings purpose built for the Prince George's County Memorial Library System. It also served as the administrative offices. The library was designed by local Mount Rainier architectural firm Walton and Madden. The architects created a characteristic mid-century modern structure with clean lines, abstract ornamentation and an asymmetrical footprint. The freestanding dome covering the entrance, with is \"space saucer\" appearance, has become a signature element of the building.",
          "address": "6530 Adelphi Road\nHyattsville, MD 20782",
          "area": "West",
          "image": "http://pgcmls.info/images/tile/pgcmls/0025-Kittner-20220510-11%20(2).jpg",
          "area_director": "Heather Jackson",
          "website": "https://www.pgcmls.info/branch/location/hyattsville",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Largo-Kettering",
          "description": "",
          "address": "9601 Capital Lane\nLargo, Maryland 20774",
          "area": "East",
          "image": "http://pgcmls.info/images/tile/pgcmls/Largo-Kettering2013.jpg",
          "area_director": "Megan Sutherland",
          "website": "https://www.pgcmls.info/branch/location/largokettering",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Laurel",
          "description": "Laurel's first library opened in 1916 in the Patuxent Bank Building and moved to 384 Main Street in 1929 in space shared with the Woman's Club of Laurel. The library got a building of its own in 1967.\n\nThe former branch building, named Stanley Memorial Library, was dedicated on May 7, 1967 and completed a major expansion in 1993. Having outgrown its building, plans were made beginning in 2005 to replace it with a new facility. The library closed on March 8, 2014, and reopened at a temporary location behind the Laurel Municipal Center on March 31, 2014, to allow for construction. After nearly a year of delay, construction of the $14 million project was to begin in October/November 2014 with a grand opening in early 2016. The project's groundbreaking ceremony occurred on May 27, 2015, with an updated opening set for the last quarter of 2016.\n\nThe Prince George's County Board of Library Trustees decided in January 2014 to remove the Stanley name from the new library, to be consistent in naming branches after their location rather than after people. A coalition of residents, including Mayor Craig Moe, campaigned to keep the Stanley name for historic reasons, and noted that the library was built on land donated by the Stanley family and named in accordance with the deed. Other residents said Charles Stanley was a Confederate soldier and by association was pro-slavery and his name should not be on the building. Library officials ultimately decided to keep the Stanley name on the building and place a memorial plaque in the building's lobby.",
          "address": "507 7th Street\nLaurel, Maryland 20707",
          "area": "North",
          "image": "https://pgcmls.info/images/locations/pgcmls/laurel-wide.jpg",
          "area_director": "Karin Luoma",
          "website": "https://www.pgcmls.info/branch/location/laurel",
          "year": 1916,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Mount Rainier",
          "description": "Although these municipally-owned branches have nearly all closed or been relocated to PGCMLS-owned spaces, one still remains. The Mount Rainier branch opened in a city-owned building in 1952; it is now the only remaining PGCMLS library in a building owned by a municipality. The Mount Rainier Branch Library, constructed on city-owned land adjacent to the City Hall, opened to the public on November 1, 1952.",
          "address": "3409 Rhode Island Ave\nMount Rainier, Maryland 20712",
          "area": "West",
          "image": "http://pgcmls.info/images/tile/pgcmls/Mt-Rainier2013.jpg",
          "area_director": "Heather Jackson",
          "website": "https://www.pgcmls.info/branch/location/mountrainier",
          "year": 1952,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "New Carrollton",
          "description": "",
          "address": "7414 Riverdale Rd\nNew Carrollton, Maryland 20784",
          "area": "West",
          "image": "http://pgcmls.info/images/tile/pgcmls/new-carrollton-branch-pic.jpg",
          "area_director": "Heather Jackson",
          "website": "https://www.pgcmls.info/branch/location/newcarrollton",
          "year": "",
          "aa_town": true,
          "comments": []
        },
        {
          "name": "Pebble Pop-up",
          "description": "As part of ongoing efforts to expand access to library resources throughout Prince George’s County, the Prince George’s County Memorial Library System (PGCMLS) will open a new self-service pop-up library at National Harbor in collaboration with the Prince George’s Arts and Humanities Council (PGAHC). Located within PGAHC’s Arts’tination gallery space (162 Waterfront St, National Harbor, Oxon Hill, Maryland 20745), the “Pebble Pop-up Library” will contain a collection of 400+ books, with a focus on books about fine and performing arts for children, arts entrepreneurship books for adults, and more. The “Pebble Pop-up Library” opens to the public on Saturday, April 30 at 1 pm and will be open during regular Arts’tination hours, Wednesday-Sunday, 1-6pm.\n\nBeginning in spring 2022, PGCMLS and PGAHC will co-present select programs for children, teens, and adults at Arts’tination, in addition to PGAHC’s cultural programs. Joint programs will be announced in the coming weeks. These events will include book discussions, art workshops, literary events, storytimes, and more.",
          "address": "162 Waterfront Street, Arts'tination\nOxon Hill, MD 20745",
          "area": "South",
          "image": "https://i0.wp.com/www.washingtoninformer.com/wp-content/uploads/2022/04/image-179.jpg?w=983&ssl=1",
          "area_director": "Melanie Townsend Diggs",
          "website": "https://www.pgahc.org/artstination",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Oxon Hill",
          "description": "Oxon Hill is home of the Sojourner Truth Room and the Speak Your Truth! Oral History Project. Most materials are available in the Sojourner Truth Room only; copies of selected materials are also available in the library's catalog. A library card or other identification is necessary for accessing some materials. A scanner and photocopy machine are available.",
          "address": "6200 Oxon Hill Rd\nOxon Hill, Maryland 20745",
          "area": "South",
          "image": "http://pgcmls.info/images/tile/pgcmls/Oxon-Hill2013.jpg",
          "area_director": "Melanie Townsend Diggs",
          "website": "https://www.pgcmls.info/branch/location/OxonHill",
          "year": "",
          "aa_town": true,
          "comments": []
        },
        {
          "name": "South Bowie",
          "description": "",
          "address": "15301 Hall Road\nBowie, Maryland 20721",
          "area": "East",
          "image": "http://pgcmls.info/images/tile/pgcmls/SouthBW.jpg",
          "area_director": "Megan Sutherland",
          "website": "https://www.pgcmls.info/branch/location/southbowie",
          "year": "",
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Spauldings",
          "description": "",
          "address": "5811 Old Silver Hill Rd\nDistrict Heights, Maryland 20747",
          "area": "Central",
          "image": "http://pgcmls.info/images/tile/pgcmls/Spauldings_AV_141104_0537_web.jpg",
          "area_director": "Quemar Rhoden",
          "website": "https://www.pgcmls.info/branch/location/spauldings",
          "year": "",
          "aa_town": true,
          "comments": []
        },
        {
          "name": "Surratts-Clinton",
          "description": "The branch, built on land once owned by the Piscataway Nation, was originally dedicated on January 21, 1980. The cost of the building was $1.5 million. Two historic names of the area (Surratt and Clinton) were joined to make the name of the branch.",
          "address": "9400 Piscataway Road\nClinton, MD 20735",
          "area": "South",
          "image": "http://pgcmls.info/images/tile/pgcmls/davies%20popup.jpg",
          "area_director": "Melanie Townsend Diggs",
          "website": "https://www.pgcmls.info/branch/location/SurrattsClinton",
          "year": 1980,
          "aa_town": false,
          "comments": []
        },
        {
          "name": "Upper Marlboro",
          "description": "The Upper Marlboro Branch opened in 1960 in a 2,300 square foot, rented storefront. The Upper Marlboro Branch operated from this facility for nearly thirty-five years, until 1995 when it reopened at its current location, the old Upper Marlboro Post Office.",
          "address": "14730 Main St\nUpper Marlboro, Maryland 20772",
          "area": "East",
          "image": "http://pgcmls.info/images/tile/pgcmls/Upper-Marlboro2013.jpg",
          "area_director": "Megan Sutherland",
          "website": "https://www.pgcmls.info/branch/location/UpperMarlboro",
          "year": 1960,
          "aa_town": false,
          "comments": []
        }
      ]}